from model import model
from langchain import FewShotPromptTemplate
from langchain_core.prompts import PromptTemplate

examples = [
    {
        "query": "أحب القراءة والكتابة في الليل ولاكن أحتاج إلى الضوء.",
        "answer": """التصحيح:
 "أحب القراءة والكتابة في الليل ولكن أحتاج إلى الضوء."

الإعراب:

أحب: فعل مضارع مرفوع وعلامة رفعه الضمة الظاهرة على آخره. والفاعل ضمير مستتر تقديره "أنا".
القراءة: مفعول به منصوب وعلامة نصبه الفتحة الظاهرة على آخره.
والكتابة: الواو حرف عطف، "الكتابة" مفعول به منصوب وعلامة نصبه الفتحة الظاهرة على آخره.
في: حرف جر.
الليل: اسم مجرور بـ "في" وعلامة جره الكسرة الظاهرة على آخره.
ولكن: حرف عطف مبني على السكون لا محل له من الإعراب.
أحتاج: فعل مضارع مرفوع وعلامة رفعه الضمة الظاهرة على آخره. والفاعل ضمير مستتر تقديره "أنا".
إلى: حرف جر.
الضوء: اسم مجرور بـ "إلى" وعلامة جره الكسرة الظاهرة على آخره."""
    }, {
        "query": " ذهبوا الولد إلى المدرسة.",
        "answer": """التصحيح:
ذهبَ الولدُ إلى المدرسة.

الإعراب:

ذهبَ: فعل ماضٍ مبني على الفتح.
الولدُ: فاعل مرفوع وعلامة رفعه الضمة الظاهرة على آخره.
إلى: حرف جر.
المدرسةِ: اسم مجرور بحرف الجر "إلى" وعلامة جره الكسرة الظاهرة على آخره.
"""
    }, {
        "query":" الطلاب في المدرسة يلعبون الكرة في الساحة الكبيرة صباحا قبل بدأ الحصص الدراسية.",
        "answer":""" التصحيح:

الطلابُ في المدرسةِ يلعبون الكرةَ في الساحةِ الكبيرةِ صباحًا قبلَ بدءِ الحصصِ الدراسية.

الإعراب:

الطلابُ: مبتدأ مرفوع وعلامة رفعه الضمة الظاهرة على آخره.
في: حرف جر.
المدرسةِ: اسم مجرور بحرف الجر "في" وعلامة جره الكسرة الظاهرة على آخره.
يلعبون: فعل مضارع مرفوع بثبوت النون لأنه من الأفعال الخمسة، والواو ضمير متصل في محل رفع فاعل.
الكرةَ: مفعول به منصوب وعلامة نصبه الفتحة الظاهرة على آخره.
في: حرف جر.
الساحةِ: اسم مجرور بحرف الجر "في" وعلامة جره الكسرة الظاهرة على آخره.
الكبيرةِ: صفة للساحة مجرورة وعلامة جرها الكسرة الظاهرة على آخرها.
صباحًا: ظرف زمان منصوب وعلامة نصبه الفتحة الظاهرة على آخره.
قبلَ: ظرف زمان منصوب وعلامة نصبه الفتحة الظاهرة على آخره، وهو مضاف.
بدءِ: مضاف إليه مجرور وعلامة جره الكسرة الظاهرة على آخره.
الحصصِ: مضاف إليه مجرور وعلامة جره الكسرة الظاهرة على آخره.
الدراسيةِ: صفة للحصص مجرورة وعلامة جرها الكسرة الظاهرة على آخرها."""
    },{
         "query":" إذا الريح يهدي الغصون تارةً و تعصف الأوراق كأنها طيرا.",
        "answer":"""التصحيح:
إذا الريحُ تهدي الغصونَ تارةً وتَعصفُ الأوراقُ كأنها طيرٌ.

الإعراب:

إذا: ظرف لما يُستقبل من الزمان خافض لشرطه، متضمن معنى الشرط.
الريحُ: مبتدأ مرفوع وعلامة رفعه الضمة الظاهرة على آخره.
تهدي: فعل مضارع مرفوع وعلامة رفعه الضمة المقدرة، والفاعل ضمير مستتر تقديره هي (يعود على الريح).
الغصونَ: مفعول به منصوب وعلامة نصبه الفتحة الظاهرة على آخره.
تارةً: ظرف زمان منصوب وعلامة نصبه الفتحة الظاهرة على آخره.
وتعصفُ: الواو حرف عطف، تَعصفُ: فعل مضارع مرفوع وعلامة رفعه الضمة الظاهرة، والفاعل ضمير مستتر تقديره هي (يعود على الريح).
الأوراقُ: فاعل مرفوع وعلامة رفعه الضمة الظاهرة على آخره.
كأنَّ: حرف تشبيه ونصب.
ها: ضمير متصل في محل نصب اسم كأنّ (يعود على الأوراق).
طيرٌ: خبر كأنّ مرفوع وعلامة رفعه الضمة الظاهرة على آخره."""
    },{
        "query":" البحر يعانق السماء كأنه رمالها تتلألأ في ضوء القمر.",
        "answer":"""التصحيح:
البحرُ يعانقُ السماءَ كأنها رمالٌ تتلألأ في ضوء القمر.

الإعراب:

البحرُ: مبتدأ مرفوع وعلامة رفعه الضمة الظاهرة على آخره.
يعانقُ: فعل مضارع مرفوع وعلامة رفعه الضمة الظاهرة على آخره، والفاعل ضمير مستتر تقديره هو (يعود على البحر)، والجملة من الفعل والفاعل في محل رفع خبر المبتدأ.
السماءَ: مفعول به منصوب وعلامة نصبه الفتحة الظاهرة على آخره.
كأنَّ: حرف تشبيه ونصب.
ها: ضمير متصل في محل نصب اسم كأنّ (يعود على السماء).
رمالٌ: خبر كأنّ مرفوع وعلامة رفعه الضمة الظاهرة على آخره.
تتلألأ: فعل مضارع مرفوع وعلامة رفعه الضمة الظاهرة، والفاعل ضمير مستتر تقديره هي (يعود على الرمال)، والجملة الفعلية في محل رفع صفة لرمال.
في: حرف جر.
ضوءِ: اسم مجرور بحرف الجر "في" وعلامة جره الكسرة الظاهرة على آخره، وهو مضاف.
القمرِ: مضاف إليه مجرور وعلامة جره الكسرة الظاهرة على آخره.
"""
    }
]

example_template = """
User: {query}
AI: {answer}
"""
example_prompt = PromptTemplate(
    input_variables=["query", "answer"],
    template=example_template
)
prefix = """[INST]المهمة: أنت خبير في اللغة العربية وقواعد النحو.

التوجيه: قم بإعراب الجملة التالية بتفصيل دقيق لكل عنصر نحوي، مع تقديم الشرح بشكل مختصر وواضح.

يرجى تصحيح  الجملة لغويا ونحويا مع الحفاظ علي المعنى.

"""
suffix = """
User: {query}
AI:[/INST] """

few_shot_prompt_template = FewShotPromptTemplate(
    examples=examples,
    example_prompt=example_prompt,
    prefix=prefix,
    suffix=suffix,
    input_variables=["query"],
    example_separator="\n\n"
)


def output_function(question):
    prompt=few_shot_prompt_template.format(query=question)
    return model.generate_text(prompt=prompt, guardrails=False)
